Autodesk.Revit.DB.ScheduleItem.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ScheduleItem.SubelementKey
The subelement key of this schedule item.

Autodesk.Revit.DB.ScheduleItem.ElementId
The element id of this schedule item.

Autodesk.Revit.DB.ScheduleItem.LinkInstanceId
If the item is from a linked model, this element id holds the link instance id. Otherwise, is invalid.

Autodesk.Revit.DB.ScheduleItem
This represents one item from a row of the schedule. On a schedule row can be grouped multiple items.
It can be an element or subelement.